posts/20220111220719-build_an_idea_factory.org
:PROPERTIES:
:ID:       911745d6-3628-4a5d-81e3-cb2b154939fe
:END:
#+TITLE: Build an idea factory
#+CREATED: [2022-01-11 Tue 22:07]
#+LAST_MODIFIED: [2022-01-21 Fri 16:27]
#+filetags: :public:


You need to setup an idea factory, a setup that will /effortlessly/ allow you to do the following:
- Record new ideas
- Build upon existing ideas
- Find contradiction

Here is what I do:
- I use emails as a note-taking apps. Related notes can be sent as replies to previous emails;
- I process emails using mu4e. It takes a few keystrokes to transform notes into a note;
- A space-repetition system prompts me randomly with existing notes everyday. I can choose to work on it, skip, or mark it as done;
- I use twitter to share specific notes;
- I regularly shitpost on Twitter to attract contradiction;
- Past a few thousand followers experts will reply to you on Twitter, use that magic power!
