20220111220719-build_an_idea_factory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-05 Mon 20:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Build an idea factory</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Build an idea factory</h1>
<p>
You need to setup an idea factory, a setup that will <i>effortlessly</i> allow you to do the following:
</p>
<ul class="org-ul">
<li>Record new ideas</li>
<li>Build upon existing ideas</li>
<li>Find contradiction</li>
</ul>

<p>
Here is what I do:
</p>
<ul class="org-ul">
<li>I use emails as a note-taking apps. Related notes can be sent as replies to previous emails;</li>
<li>I process emails using mu4e. It takes a few keystrokes to transform notes into a note;</li>
<li>A space-repetition system prompts me randomly with existing notes everyday. I can choose to work on it, skip, or mark it as done;</li>
<li>I use twitter to share specific notes;</li>
<li>I regularly shitpost on Twitter to attract contradiction;</li>
<li>Past a few thousand followers experts will reply to you on Twitter, use that magic power!</li>
</ul>

<div id="outline-container-org13d82da" class="outline-2">
<h2 id="org13d82da">Links to this note</h2>
<div class="outline-text-2" id="text-org13d82da">
<ul class="org-ul">
<li><a href="./20220105150821-workflow.html">Workflow</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
